/*
проонализировать персонажей
длч каждого определить 8 полей данных(сила,здоровье), 3-4 поля поведения (методов атаковать, вылечить...)
создать абстрактный класс и иерархию наследников
 */
/*
Крестьянин:
- здоровье
- сила
- ловкость
- выносливость
- вид оружия
- уровень
- ID
- имя

Разбойник:
- ID
- имя
- здоровье
- сила
- ловкость
- выносливость
- вид оружия

Снайпер:
- ID
- имя
- здоровье
- сила
- ловкость
- выносливость
- вид оружия
- меткость
- маскировка

Колдун:
- ID
- имя
- здоровье
- интеллект
- выносливость
- вид оружия
- мана

Копейщик:
- ID
- имя
- здоровье
- сила
- выносливость
- вид оружия
- защита

Арбалетчик:
- ID
- имя
- здоровье
- выносливость
- вид оружия
- меткость
- количество стрел
- скорость стрельбы

Монах:
- ID
- имя
- здоровье
- выносливость
- интеллект
- вид оружия
- вера
- чакра
 */

public class Main {

    public static void main(String[] args) {
        
        Sniper sniper = new Sniper(0, null, 0, 0, null, 0, 0);

        //sniper.
    }
}

